case/coCharBed/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          960;
        startFace       47120;
    }
    inlet
    {
//         type            patch;
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1360;
        startFace       48080;
    }
    outlet
    {
//         type            patch;
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1360;
        startFace       49440;
    }
)

// ************************************************************************* //
