case/coCharBed/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.04082);

boundaryField
{
    walls
    {
        type            noSlip;
    }
    inlet
    {
        type            interstitialInletVelocity;
        inletVelocity   uniform (0 0 0.04082);
        value           uniform (0 0 0.04082);
        phi             alphaRhoPhi;
        alpha           alpha;
    }
    outlet
    {
//         type            pressureInletOutletVelocity;
//         phi             alphaRhoPhi;
//         value           uniform (0 0 0.04082);
        type            inletOutlet;
        phi             alphaRhoPhi;
        value           uniform (0 0 0);
        inletValue      uniform (0 0 0);
    }
}


// ************************************************************************* //
